{
  "1": {
    "items": [
      {
        "title": "Parity 1.7",
        "background": "https://raw.githubusercontent.com/paritytech/parity-news/4dff6ab3761f4e8959e00201e32e11dd3e8e2d8d/images/clouds.jpg",
        "markdown": "It has been all too long since our last release. Some four months have passed since the 1.6 series and over that time we've seen the rise of ETH and BTC, ICO fever hit the streets of Ethereum and an increased presence of Ethereum in the mainstream press. We can finally announce the 1.7 series. Much has gone on behind the scenes to bring you this release and I very much hope you'll enjoy it.\n\nWith the Parity 1.7.0 release we are proud to announce experimental support for light clients and web wallets. The light client can be enabled by starting Parity with the `--light` command-line flag. The web wallet is a public Parity node that keeps the keys and signs transactions using your local browser storage. Try it at [wallet.parity.io](https://wallet.parity.io) or run your own with the `--public-node` flag. An additional important feature is the experimental WASM contract support: As an alternative to the venerable EVM, we can now offer WebAssembly as an alternative runtime for which contracts may be implemented.\n\nTo get an overview of everything included, read the [release accouncement](https://blog.parity.io/announcing-parity-1-7/) on our blog."
      },
      {
        "title": "Security Update",
        "background": "https://raw.githubusercontent.com/paritytech/parity-news/446e2484d3fa600f05a326637441eb39b52ffee7/images/ladybird.jpg",
        "markdown": "A quick update on the status of Parity Ethereum client.\n\n**Bug Bounty.** There is now a significant amount in our [bug bounty](https://etherscan.io/address/0x00f1c77935ac482fc075b55b5990e86ea40851bb) programme (many thanks to all contributors). As mentioned in a previous post, critical security bugs in the latest versions of Parity, both beta and stable branches, are valid targets for bounty-collecting reports. The multi-sig wallet, in particular, should be considered a prime target for review and any significant bug will attract a large proportion of the bounty. Any bugs found should be reported to security@parity.io.\n\n**Multi-sig Wallet.** Several minor changes have been made to the Parity multi-sig, mainly to enable compilation by later versions of Solidity. We understand the 'white hat group' is using this code to return some of the funds they temporarily commandeered. After [code reviews](https://github.com/paritytech/contracts/pull/48) by many of our developers, there are no known issues. The bug bounty programme is active and we have so far had no issues reported.\n\n**Please Upgrade!** Though we try to be as thorough as a bleeding-edge software project can be, bugs sometimes creep into our codebase and, as recent events show, left unchecked these can have significant impacts in the wild. Older versions of Parity can have known bugs (generally mentioned in the release notes): if you are using Parity for anything of any significant value please do ensure that you are running the latest version to minimise the chances of any problems and establish procedures according to the value as risk.\n\nRead the full [security update](https://blog.parity.io/security-update/), the [postmortem](https://blog.parity.io/the-multi-sig-hack-a-postmortem/) of the recent hacks, and learn about our new [bug bounty program](https://blog.parity.io/announcing-parity-bug-bounty-program/) on our blog."
      },
      {
        "title": "Questions?",
        "background": "https://raw.githubusercontent.com/paritytech/parity-news/e996f821b74f2a723c41ac2362a258606d938060/images/blackboard.jpg",
        "markdown": "Have questions? We would like to get them answered. The [Parity wiki](https://github.com/paritytech/parity/wiki) should be the first stop for any general questions in running the software, configuring it or just trying out some of the basic or advanced features of Parity, either as a user, developer or miner.\n\nIf you prefer direct interaction with the team, join us on our [gitter channel](https://gitter.im/paritytech/parity) and feel free to ask any questions."
      }
    ]
  }
}
