{
  "1": {
    "items": [
      {
        "title": "Parity 1.8",
        "background": "https://raw.githubusercontent.com/paritytech/parity-news/3f7be40e696db0cf03915655707b74a06791f71f/images/sun-fog.jpg",
        "markdown": "Winter may be coming but the moment you've all been waiting for has finally arrived: Parity Tech is excited to announce the release of the bigger and better **1.8.0**! This release will see light client improvements: Proof-of-Authority chain compatibility, even with dynamic authority sets, and also feature compatibility with the Whisper v6 wire protocol. Read [more at the blog](https://paritytech.io/blog/announcing-parity-1-8.html)."
      },
      {
        "title": "Ropsten Revival",
        "background": "https://raw.githubusercontent.com/paritytech/parity-news/e996f821b74f2a723c41ac2362a258606d938060/images/chemistry.jpg",
        "markdown": "We are pleased to [announce](https://github.com/ethereum/ropsten/blob/master/revival.md) that the Ropsten testnet has been revived! Thanks to a generous donation of GPU hashpower, the Ropsten chain has been cleared of the spam blocks that had accumulated in a [recent attack](http://ethereum.stackexchange.com/q/12477).\n\nWhile there is a trend toward adoption of alternative [proof-of-authority](https://github.com/paritytech/parity/wiki/Proof-of-Authority-Chains) consensus protocols for Ethereum testnets, such as [Kovan](https://github.com/kovan-testnet/proposal), Ropsten as a public proof-of-work Ethereum testnet remains relevant for multiple reasons.\n\nSince the Ethereum mainnet still operates based on PoW consensus, a PoW testnet best reproduces the current production environment, i.e. system and network conditions on the live Ethereum mainnet. Thus, Ropsten is useful for experiments to investigate certain issues that we observe today on the mainnet, such as the relation between uncle rates and gas prices. And for Dapp developers, Ropsten is useful for realistic tests of back-end performance (i.e. mainnet transactions and block times) and front-end user experience. If you have any questions, join the [gitter chat](http://gitter.im/ethereum/ropsten)."
      },
      {
        "title": "Questions?",
        "background": "https://raw.githubusercontent.com/paritytech/parity-news/e996f821b74f2a723c41ac2362a258606d938060/images/blackboard.jpg",
        "markdown": "Have questions? We would like to get them answered. The [Parity wiki](https://github.com/paritytech/parity/wiki) should be the first stop for any general questions in running the software, configuring it or just trying out some of the basic or advanced features of Parity, either as a user, developer or miner.\n\nIf you prefer direct interaction with the team, join us on our [gitter](https://gitter.im/paritytech/parity) or [riot](https://riot.im/app/#/room/#parity-watercooler:matrix.org) channel and feel free to ask any questions."
      }
    ]
  }
}
